#+STARTUP: showeverything
#+STARTUP: nohideblocks
#+STARTUP: indent
#+PROPERTY: header-args:sql :engine postgresql
#+PROPERTY: header-args:sql+ :dbhost 0.0.0.0
#+PROPERTY: header-args:sql+ :dbport 5434
#+PROPERTY: header-args:sql+ :dbuser food_user
#+PROPERTY: header-args:sql+ :dbpassword some_password
#+PROPERTY: header-args:sql+ :database food
#+PROPERTY: header-args:sql+ :results table drawer
#+PROPERTY: header-args:sh  :results verbatim org
#+PROPERTY: header-args:sh+ :prologue exec 2>&1 :epilogue :

* Appendix: For the impatient

If you want to skip all the cleansing and transformation you can
execute the following /inside bastion/:

#+BEGIN_SRC sh :dir /docker:root@tutorial_bastion:/ 
     curl "https://data.cityofchicago.org/api/views/4ijn-s7e5/rows.csv?accessType=DOWNLOAD" > data/inspections.csv

     psql ${FOOD_DB_URL} -c "\copy raw.inspections FROM '/data/inspections.csv' WITH HEADER CSV"

     psql ${FOOD_DB_URL} < /sql/create_cleaned_inspections_table.sql

     psql ${FOOD_DB_URL} < /sql/create_violations_table.sql

     psql ${FOOD_DB_URL} < /sql/create_semantic_tables.sql
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
CREATE SCHEMA
DROP TABLE
SELECT 164178
DROP TABLE
SELECT 618060
CREATE SCHEMA
DROP TABLE
SELECT 34812
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
DROP TABLE
SELECT 141721
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
CREATE INDEX
#+END_SRC


If everything works, you should end with two new schemas: =cleaned= and =semantic=.

You could check that (from =psql=) With
#+BEGIN_SRC sql
\dn
#+END_SRC

#+RESULTS:
:RESULTS:
| List of schemas |          |
|-----------------+----------|
| Name            | Owner    |
| cleaned         | food_user |
| postgis         | food_user |
| public          | postgres |
| raw             | food_user |
| semantic        | food_user |
:END:

Now you can continue with [[file:triage_intro.org][Introduction to triage]]. 

